swiftat-itwfeg/UnifiedGTXproRT1024/board/pin_mux.c
    /* rs485 group1 pin11 configured as uart5 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_11_LPUART5_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_11_LPUART5_RX, 0x10B0U ); 
    
    /* debug interface group3 pin21 configured as uart6 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_01_LPUART6_RX, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_01_LPUART6_RX, 0x10B0U );

    /* debug interface group3 pin20 configured as uart6 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_00_LPUART6_TX, 0U );    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_00_LPUART6_TX, 0x10B0U ); 

    /* cutter group1 pin6 configured as uart1 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0x10B0U ); 
    
    /* cutter group1 pin7 configured as uart1 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0x10B0U );
   
    /* usb id group3 pin8 configured as usb id */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_40_USB_OTG1_ID, 0U );       

    /* debug group2 pin22 configured as uart2 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_22_LPUART2_TX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_22_LPUART2_TX, 0x10B0U );                               
    
    /* debug group2 pin23 configured as uart2 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_23_LPUART2_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_23_LPUART2_RX, 0x10B0U ); 

/***************************** sensor signals *********************************/    

    /* label taken group1 pin13 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_13_GPIO1_IO13, 0U );                                                
    
    /* low label stock group1 pin14 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_14_GPIO1_IO14, 0U );                                    

    /* shoot through group1 pin23 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U );                                    
    
    /* paper takeup group1 pin24 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0U );                                    

    /* print head temperature group1 pin25 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U );                                    

    /* print head dot group1 pin27 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U );                                    

    /* print head up group1 pin26 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U );     

    /* print head detection group1 pin15 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0U );   
    
/***************************** weigher signals ********************************/

    /* ext weigher adc clk group2 pin26 configured as pwma0  */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00, 0x10B0U );                                 
   
    /* ext weigher adc reset group3 pin5 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0x70A0U );   
    GPIO_PinInit( WGR_RESET_GPIO, WGR_RESET_PIN, &outCfg );   
    
    /* weigher service switch group2 pin6 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_06_GPIO2_IO06, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_06_GPIO2_IO06, 0x70A0U ); 
    inCfg.interruptMode         = kGPIO_IntFallingEdge;
    GPIO_PinInit( SERVICE_SWITCH_GPIO, SERVICE_SWITCH_PIN, &inCfg ); 
    
    /* weigher accelerometer int a group2 pin14 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_14_GPIO2_IO14, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_14_GPIO2_IO14, 0x70A0U ); 
    outCfg.outputLogic          = 1U;   

    /* weigher accelerometer int b group2 pin15 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_15_GPIO2_IO15, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_15_GPIO2_IO15, 0x70A0U );  
    
    GPIO_PinInit( ACCEL_INTB_GPIO, ACCEL_INTB_PIN, &outCfg );       

    /* weigher accelerometer group2 pin2 configured as lpi2c clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 1U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 0xD8B0U );                       

    /* weigher accelerometer group2 pin3 configured as lpi2c sda */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 1U );                            
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 0xD8B0U );                           
    
    #if 0 
    /* weigher accelerometer group1 pin28 configured as lpspi3 clk */            
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0x10A0U );  
    #else
    outCfg.outputLogic          = 0U;
    /* debug */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0x70A0U );  
    GPIO_PinInit( ACCEL_SPI_CLK_GPIO, ACCEL_SPI_CLK_PIN, &outCfg ); 
    GPIO_WritePinOutput( ACCEL_SPI_CLK_GPIO, ACCEL_SPI_CLK_PIN, false );     
    #endif  
        
    #if 0 
    /* weigher accelerometer group1 pin30 configured as lpspi3 mosi */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0x70B0U ); 
    #else
    /* debug */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0x70A0U );  
    GPIO_PinInit( ACCEL_SPI_MOSI_GPIO, ACCEL_SPI_MOSI_PIN, &outCfg ); 
    GPIO_WritePinOutput( ACCEL_SPI_MOSI_GPIO, ACCEL_SPI_MOSI_PIN, false );         
    #endif  
        
